<!DOCTYPE html>
<html lang="{{ str_replace('_', '-', app()->getLocale()) }}">
<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="stylesheet" href="/css/reseter.css">
    <link rel="stylesheet" href="/css/bootstrap-grid.min.css">
    <link rel="stylesheet" href="/css/main.css">
    <title>Laravel</title>
</head>
<body>
<main>
    <aside class="aside">
        <div class="aside__header">
            <a href="/" class="aside__logo logo">
                Storage of <span class="blue">things</span>
            </a>
        </div>
        <div class="aside__body">
            <div class="aside__functions">
                <a href="/things/create" class="aside__button">
                    +
                    <span>Создать вещь</span>
                </a>
            </div>
            <nav class="aside__nav">
                <ul class="aside__menu">
                    <li class="aside__item">
                        <a href="/" class="aside__link">
                            <span class="aside__name">
                                <svg width="20px" height="20px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M19 7.90637V18C19 19.1046 18.1046 20 17 20H7C5.89543 20 5 19.1046 5 18V7.90637M2 10.0001L10.8531 3.80297C11.5417 3.32092 12.4583 3.32092 13.1469 3.80297L22 10.0001" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                                </svg>
                                Главная панель
                            </span>
                        </a>
                    </li>
                    <li class="aside__item">
                        <a href="#" class="aside__link">
                                <span class="aside__name">
                                    <svg width="20px" height="20px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M10.5021 1.40276C10.9577 1.14026 11.4742 1.00208 12 1.00208C12.5258 1.00208 13.0424 1.14027 13.4979 1.4028L13.5 1.404L20.5 5.40399C20.87 5.61763 21.1892 5.90725 21.437 6.25252C21.4973 6.31286 21.5508 6.38195 21.5955 6.45928C21.6341 6.52587 21.664 6.59505 21.6858 6.66555C21.8916 7.07909 21.9995 7.5354 22 7.999V16.0011C21.9995 16.5271 21.8606 17.0438 21.5973 17.4993C21.334 17.9548 20.9556 18.333 20.5 18.5961L20.4961 18.5983L13.5 22.5961L13.4982 22.5971C13.181 22.7799 12.8341 22.9025 12.4752 22.9601C12.3338 23.0366 12.172 23.08 12 23.08C11.828 23.08 11.6662 23.0366 11.5248 22.9601C11.1659 22.9025 10.8191 22.78 10.5019 22.5971L10.5 22.5961L3.50386 18.5983L3.5 18.5961C3.04439 18.333 2.66597 17.9548 2.40269 17.4993C2.13941 17.0438 2.00054 16.5271 2 16.0011V7.999C2.00048 7.53563 2.10827 7.07955 2.31385 6.66618C2.33566 6.59546 2.3657 6.52606 2.40433 6.45928C2.44917 6.38177 2.50282 6.31254 2.56328 6.25211C2.8111 5.90702 3.13012 5.61755 3.5 5.404L3.50386 5.40177L10.5021 1.40276ZM13 20.5783L19.5 16.864L19.5016 16.8631C19.6527 16.7754 19.7783 16.6497 19.8658 16.4984C19.9535 16.3466 19.9998 16.1744 20 15.999V8.53751L13 12.5868V20.5783ZM11 12.5868V20.5783L4.5 16.864L4.49842 16.8631C4.34726 16.7754 4.22169 16.6497 4.13423 16.4984C4.04654 16.3467 4.00025 16.1746 4 15.9994V8.53758L11 12.5868ZM12.5 3.13606L18.961 6.82803L11.9999 10.8547L5.03897 6.82807L11.4961 3.13828L11.5 3.13605C11.652 3.04828 11.8245 3.00208 12 3.00208C12.1755 3.00208 12.348 3.04829 12.5 3.13606Z" fill="currentColor"/>
                                    </svg>
                                    Вещи
                                </span>
                            <svg fill="currentColor" width="24px" height="24px" viewBox="-12 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0.88 23.28c-0.2 0-0.44-0.080-0.6-0.24-0.32-0.32-0.32-0.84 0-1.2l5.76-5.84-5.8-5.84c-0.32-0.32-0.32-0.84 0-1.2 0.32-0.32 0.84-0.32 1.2 0l6.44 6.44c0.16 0.16 0.24 0.36 0.24 0.6s-0.080 0.44-0.24 0.6l-6.4 6.44c-0.2 0.16-0.4 0.24-0.6 0.24z"></path>
                            </svg>
                        </a>
                        <ul class="aside__submenu">
                            @auth
                            <li class="aside__item">
                                <a href="/things/my" class="aside__link">
                                    <span class="aside__name">
                                        <svg width="20px" height="20px" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M30.051 45.6071L17.851 54.7401C17.2728 55.1729 16.5856 55.4363 15.8662 55.5008C15.1468 55.5652 14.4237 55.4282 13.7778 55.1049C13.1319 54.7817 12.5887 54.2851 12.209 53.6707C11.8293 53.0563 11.6281 52.3483 11.628 51.626V15.306C11.628 13.2423 12.4477 11.2631 13.9069 9.8037C15.3661 8.34432 17.3452 7.52431 19.409 7.52405H45.35C47.4137 7.52431 49.3929 8.34432 50.8521 9.8037C52.3112 11.2631 53.131 13.2423 53.131 15.306V51.625C53.1309 52.3473 52.9297 53.0553 52.55 53.6697C52.1703 54.2841 51.6271 54.7807 50.9812 55.1039C50.3353 55.4272 49.6122 55.5642 48.8928 55.4998C48.1734 55.4353 47.4862 55.1719 46.908 54.739L34.715 45.6071C34.0419 45.1031 33.2238 44.8308 32.383 44.8308C31.5422 44.8308 30.724 45.1031 30.051 45.6071V45.6071Z" stroke="currentColor" stroke-width="6" stroke-linecap="round" stroke-linejoin="round"/>
                                        </svg>
                                        Мои вещи
                                    </span>
                                </a>
                            </li>
                            <li class="aside__item">
                                <a href="/things/repairing" class="aside__link">
                                    <span class="aside__name">
                                        <svg width="20px" height="20px" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg" fill="currentColor">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M14.773 3.485l-.78-.184-2.108 2.096-1.194-1.216 2.056-2.157-.18-.792a4.42 4.42 0 0 0-1.347-.228 3.64 3.64 0 0 0-1.457.28 3.824 3.824 0 0 0-1.186.84 3.736 3.736 0 0 0-.875 1.265 3.938 3.938 0 0 0 0 2.966 335.341 335.341 0 0 0-6.173 6.234c-.21.275-.31.618-.284.963a1.403 1.403 0 0 0 .464.967c.124.135.272.247.437.328.17.075.353.118.538.127.316-.006.619-.126.854-.337 1.548-1.457 4.514-4.45 6.199-6.204.457.194.948.294 1.444.293a3.736 3.736 0 0 0 2.677-1.133 3.885 3.885 0 0 0 1.111-2.73 4.211 4.211 0 0 0-.196-1.378zM2.933 13.928a.31.31 0 0 1-.135.07.437.437 0 0 1-.149 0 .346.346 0 0 1-.144-.057.336.336 0 0 1-.114-.11c-.14-.143-.271-.415-.14-.568 1.37-1.457 4.191-4.305 5.955-6.046.1.132.21.258.328.376.118.123.245.237.38.341-1.706 1.75-4.488 4.564-5.98 5.994zm11.118-9.065c.002.765-.296 1.5-.832 2.048a2.861 2.861 0 0 1-4.007 0 2.992 2.992 0 0 1-.635-3.137A2.748 2.748 0 0 1 10.14 2.18a2.76 2.76 0 0 1 1.072-.214h.254L9.649 3.839v.696l1.895 1.886h.66l1.847-1.816v.258zM3.24 6.688h1.531l.705.717.678-.674-.665-.678V6.01l.057-1.649-.22-.437-2.86-1.882-.591.066-.831.849-.066.599 1.838 2.918.424.215zm-.945-3.632L4.609 4.58 4.57 5.703H3.494L2.002 3.341l.293-.285zm7.105 6.96l.674-.673 3.106 3.185a1.479 1.479 0 0 1 0 2.039 1.404 1.404 0 0 1-1.549.315 1.31 1.31 0 0 1-.437-.315l-3.142-3.203.679-.678 3.132 3.194a.402.402 0 0 0 .153.105.477.477 0 0 0 .359 0 .403.403 0 0 0 .153-.105.436.436 0 0 0 .1-.153.525.525 0 0 0 .036-.184.547.547 0 0 0-.035-.184.436.436 0 0 0-.1-.153L9.4 10.016z"/>
                                        </svg>
                                        В ремонте/мойке
                                    </span>
                                </a>
                            </li>
                            <li class="aside__item">
                                <a href="/things/transfered" class="aside__link">
                                    <span class="aside__name">
                                        <svg width="20px" height="20px" viewBox="0 0 48 48" xmlns="http://www.w3.org/2000/svg">
                                            <path fill="currentColor" d="M19,26a2,2,0,0,0-2,2V40H7V28a2,2,0,0,0-4,0V42a2,2,0,0,0,2,2H19a2,2,0,0,0,2-2V28A2,2,0,0,0,19,26Z"/>
                                            <path fill="currentColor" d="M43,26a2,2,0,0,0-2,2V40H31V28a2,2,0,0,0-4,0V42a2,2,0,0,0,2,2H43a2,2,0,0,0,2-2V28A2,2,0,0,0,43,26Z"/>
                                            <path fill="currentColor" d="M34,16v1.2l-2.6-2.6a1.9,1.9,0,0,0-3,.2,2.1,2.1,0,0,0,.2,2.7l6,5.9a1.9,1.9,0,0,0,2.8,0l6-5.9a2.1,2.1,0,0,0,.2-2.7,1.9,1.9,0,0,0-3-.2L38,17.2V16a14,14,0,0,0-28,0v6a2,2,0,0,0,4,0V16a10,10,0,0,1,20,0Z"/>
                                        </svg>
                                        Переданные вещи
                                    </span>
                                </a>
                            </li>
                            @endauth
                            <li class="aside__item">
                                <a href="/things" class="aside__link">
                                    <span class="aside__name">
                                        <svg width="20px" height="20px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M10.5021 1.40276C10.9577 1.14026 11.4742 1.00208 12 1.00208C12.5258 1.00208 13.0424 1.14027 13.4979 1.4028L13.5 1.404L20.5 5.40399C20.87 5.61763 21.1892 5.90725 21.437 6.25252C21.4973 6.31286 21.5508 6.38195 21.5955 6.45928C21.6341 6.52587 21.664 6.59505 21.6858 6.66555C21.8916 7.07909 21.9995 7.5354 22 7.999V16.0011C21.9995 16.5271 21.8606 17.0438 21.5973 17.4993C21.334 17.9548 20.9556 18.333 20.5 18.5961L20.4961 18.5983L13.5 22.5961L13.4982 22.5971C13.181 22.7799 12.8341 22.9025 12.4752 22.9601C12.3338 23.0366 12.172 23.08 12 23.08C11.828 23.08 11.6662 23.0366 11.5248 22.9601C11.1659 22.9025 10.8191 22.78 10.5019 22.5971L10.5 22.5961L3.50386 18.5983L3.5 18.5961C3.04439 18.333 2.66597 17.9548 2.40269 17.4993C2.13941 17.0438 2.00054 16.5271 2 16.0011V7.999C2.00048 7.53563 2.10827 7.07955 2.31385 6.66618C2.33566 6.59546 2.3657 6.52606 2.40433 6.45928C2.44917 6.38177 2.50282 6.31254 2.56328 6.25211C2.8111 5.90702 3.13012 5.61755 3.5 5.404L3.50386 5.40177L10.5021 1.40276ZM13 20.5783L19.5 16.864L19.5016 16.8631C19.6527 16.7754 19.7783 16.6497 19.8658 16.4984C19.9535 16.3466 19.9998 16.1744 20 15.999V8.53751L13 12.5868V20.5783ZM11 12.5868V20.5783L4.5 16.864L4.49842 16.8631C4.34726 16.7754 4.22169 16.6497 4.13423 16.4984C4.04654 16.3467 4.00025 16.1746 4 15.9994V8.53758L11 12.5868ZM12.5 3.13606L18.961 6.82803L11.9999 10.8547L5.03897 6.82807L11.4961 3.13828L11.5 3.13605C11.652 3.04828 11.8245 3.00208 12 3.00208C12.1755 3.00208 12.348 3.04829 12.5 3.13606Z" fill="currentColor"/>
                                        </svg>
                                        Все вещи
                                    </span>
                                </a>
                            </li>
                        </ul>
                    </li>
                    <li class="aside__item">
                        <a href="#" class="aside__link">
                                <span class="aside__name">
                                    <svg width="20px" height="20px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3 11.1716V5C3 3.89543 3.89543 3 5 3H11.1716C11.702 3 12.2107 3.21071 12.5858 3.58579L20.5858 11.5858C21.3668 12.3668 21.3668 13.6332 20.5858 14.4142L14.4142 20.5858C13.6332 21.3668 12.3668 21.3668 11.5858 20.5858L3.58579 12.5858C3.21071 12.2107 3 11.702 3 11.1716Z" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"/>
                                        <path d="M7 7H7.001" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"/>
                                    </svg>
                                    Места
                                </span>
                            <svg fill="currentColor" width="24px" height="24px" viewBox="-12 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0.88 23.28c-0.2 0-0.44-0.080-0.6-0.24-0.32-0.32-0.32-0.84 0-1.2l5.76-5.84-5.8-5.84c-0.32-0.32-0.32-0.84 0-1.2 0.32-0.32 0.84-0.32 1.2 0l6.44 6.44c0.16 0.16 0.24 0.36 0.24 0.6s-0.080 0.44-0.24 0.6l-6.4 6.44c-0.2 0.16-0.4 0.24-0.6 0.24z"></path>
                            </svg>
                        </a>
                        <ul class="aside__submenu">
                            @auth
                                <li class="aside__item">
                                    <a href="/places/my" class="aside__link">
                                    <span class="aside__name">
                                        <svg width="20px" height="20px" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M30.051 45.6071L17.851 54.7401C17.2728 55.1729 16.5856 55.4363 15.8662 55.5008C15.1468 55.5652 14.4237 55.4282 13.7778 55.1049C13.1319 54.7817 12.5887 54.2851 12.209 53.6707C11.8293 53.0563 11.6281 52.3483 11.628 51.626V15.306C11.628 13.2423 12.4477 11.2631 13.9069 9.8037C15.3661 8.34432 17.3452 7.52431 19.409 7.52405H45.35C47.4137 7.52431 49.3929 8.34432 50.8521 9.8037C52.3112 11.2631 53.131 13.2423 53.131 15.306V51.625C53.1309 52.3473 52.9297 53.0553 52.55 53.6697C52.1703 54.2841 51.6271 54.7807 50.9812 55.1039C50.3353 55.4272 49.6122 55.5642 48.8928 55.4998C48.1734 55.4353 47.4862 55.1719 46.908 54.739L34.715 45.6071C34.0419 45.1031 33.2238 44.8308 32.383 44.8308C31.5422 44.8308 30.724 45.1031 30.051 45.6071V45.6071Z" stroke="currentColor" stroke-width="6" stroke-linecap="round" stroke-linejoin="round"/>
                                        </svg>
                                        Мои места
                                    </span>
                                    </a>
                                </li>
                            @endauth
                            <li class="aside__item">
                                <a href="/places" class="aside__link">
                                    <span class="aside__name">
                                        <svg width="20px" height="20px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M3 11.1716V5C3 3.89543 3.89543 3 5 3H11.1716C11.702 3 12.2107 3.21071 12.5858 3.58579L20.5858 11.5858C21.3668 12.3668 21.3668 13.6332 20.5858 14.4142L14.4142 20.5858C13.6332 21.3668 12.3668 21.3668 11.5858 20.5858L3.58579 12.5858C3.21071 12.2107 3 11.702 3 11.1716Z" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"/>
                                            <path d="M7 7H7.001" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"/>
                                        </svg>
                                        Все места
                                    </span>
                                </a>
                            </li>
                        </ul>
                    </li>
                    <li class="aside__item">
                        <a href="/archive" class="aside__link">
                            <span class="aside__name">
                                <svg width="20px" height="20px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5 6.77273H9.2M19 6.77273H14.8M9.2 6.77273V5.5C9.2 4.94772 9.64772 4.5 10.2 4.5H13.8C14.3523 4.5 14.8 4.94772 14.8 5.5V6.77273M9.2 6.77273H14.8M6.4 8.59091V15.8636C6.4 17.5778 6.4 18.4349 6.94673 18.9675C7.49347 19.5 8.37342 19.5 10.1333 19.5H13.8667C15.6266 19.5 16.5065 19.5 17.0533 18.9675C17.6 18.4349 17.6 17.5778 17.6 15.8636V8.59091M9.2 10.4091V15.8636M12 10.4091V15.8636M14.8 10.4091V15.8636" stroke="currentColor" stroke-linecap="round" stroke-width="2" stroke-linejoin="round"/>
                                </svg>
                                Архив
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </aside>
    <div class="topbar">
        <button class="topbar__button">
            @auth
                {{ strtoupper(substr(Auth::user()->name, 0, 1)) }}
            @endauth
            @guest
                Hi!
            @endguest
        </button>
        <div class="topbar__account account">
            <div class="account__header">
                <span>Профиль</span>
                <span class="account__close">
                    <svg fill="currentColor" width="20px" height="20px" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12,23A11,11,0,1,0,1,12,11.013,11.013,0,0,0,12,23ZM12,3a9,9,0,1,1-9,9A9.01,9.01,0,0,1,12,3ZM8.293,14.293,10.586,12,8.293,9.707A1,1,0,0,1,9.707,8.293L12,10.586l2.293-2.293a1,1,0,0,1,1.414,1.414L13.414,12l2.293,2.293a1,1,0,1,1-1.414,1.414L12,13.414,9.707,15.707a1,1,0,0,1-1.414-1.414Z"/>
                    </svg>
                </span>
            </div>
            <div class="account__body">
                @auth
                    <div class="account__circle">{{ strtoupper(substr(Auth::user()->name, 0, 1)) }}</div>
                    <p class="account__username">{{ Auth::user()->name }}</p>
                    <p class="account__email">{{ Auth::user()->email }}</p>
                    <a href="/logout" class="account__button button">Выйти</a>
                @endauth
                @guest
                    <p class="account__help">Войдите, для использования всех возможностей сервиса</p>
                    <a href="/login" class="account__button button">Войти</a>
                @endguest
            </div>
        </div>
    </div>
    <div class="content">
        @yield('content')
    </div>
</main>
<script src="/js/main.js"></script>
</body>
</html>
